app/Controllers/EmpHomeController.php

    private function insertLoginTime($employeeId)
    {
        // Fetch current time
        date_default_timezone_set('Africa/Kampala');
        $time = date('H:i', strtotime('+0 HOURS'));

        // Insert into attendance table
        $data = [
            'employee_id' => $employeeId,
            'clock_in_time' => $time
        ];
        $this->db->table('attendance_table')->insert($data);
---
INSERT INTO `attendance_table` (`employee_id`, `clock_in_time`) VALUES ('31', '09:22')