app/Controllers/Home.php

SELECT COUNT(*) AS `numrows`
FROM `department_table`
SELECT COUNT(*) AS `numrows`
FROM `loan_table`
SELECT COUNT(*) AS `numrows`
FROM `employee_table`
SELECT COUNT(*) AS `numrows`
FROM `leave_type_table`
SELECT COUNT(*) AS `numrows`
FROM `job_type_table`
---
    public function Dashboard()
    {

        //fetching number of departments
        $db      = \Config\Database::connect();
        $builder = $db->table('department_table');
        $department   = $builder->countAllResults(); // Count all records in the table

        //fetching number of employees
        $builder = $db->table('employee_table');
        $employees   = $builder->countAllResults();

        //fetching number of leaves
        $builder = $db->table('leave_type_table');
        $leave   = $builder->countAllResults();